ext_alsav/DataProcessors/ВыгрузкаОстатковCSV.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаОстатковCSV</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеСоСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикОтгрузкиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоНеобеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/DataProcessors/ВыгрузкаОстатковCSV/Ext/ManagerModule.bsl
Функция СтруктураВjson(Значение)  ЭКСПОРТ

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли;

	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции

Функция МассивСтруктурВCSV(данные)ЭКСПОРТ
	Если ЛОЖЬ Тогда данные = новый Массив; КонецЕсли;
	
	контент = "";
	Для Каждого стр из данные Цикл
		Если ЛОЖЬ Тогда стр = Новый Структура; КонецЕсли;
		
		контент = контент + ?(контент = "","",Символы.ПС);
		этоПерваяКолонка = истина;
		Для Каждого эл из стр цикл              
			знч = "";
			Если ТипЗнч(эл.Значение) = Тип("Число") Тогда 
				знч = НормализоватьЧисло(эл.Значение);
			Иначе
				знч = СокрЛП(Строка(эл.Значение));
			КонецЕсли;
			
			контент	= контент + ?(этоПерваяКолонка,"",";")+ знч;			
			этоПерваяКолонка = ложь;
		КонецЦикла;
	КонецЦикла;
	
	Возврат контент;
КонецФункции

Функция ВыгрузитьОстаток_ХОФФ() ЭКСПОРТ
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса_ХОФФ();
	
	контент = "";
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		стрАртикул = СокрЛП(Строка(рез.Артикул));
		стрОстаток = НормализоватьЧисло(рез.Остаток);
		Если ЗначениеЗаполнено(стрАртикул) и ЗначениеЗаполнено(стрОстаток) и (рез.Остаток > 0) Тогда
			контент = контент + ?(контент = "","",Символы.ПС)
				+ стрАртикул
				+";"
				+ стрОстаток
			;
		КонецЕсли;
	КонецЦикла;
	
	ФТПСоединение = Новый FTPСоединение("secret_alsav_ftp",21,"secret_alsav_csv_login","secret_alsav_csv_password");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);
	
	ФТПСоединение.Записать(ВременныйФайл,"alsav_hoff.csv"); 
	УдалитьФайлы(ВременныйФайл);	
КонецФункции  

Функция ВыгрузитьОстаток_express_office() ЭКСПОРТ
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса_express_office(); 
	
	группыНоманклатуры = новый Массив();
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ-00020935"));//1.1 Продукция стандартная
	
	имеетВариантКомплектации = новый Массив();
	имеетВариантКомплектации.Добавить(ложь);
	имеетВариантКомплектации.Добавить(неопределено);
	
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры); 
	Запрос.УстановитьПараметр("имеетВариантКомплектации",ложь);
	
	контент = "";
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		стрШтрихкод = СокрЛП(Строка(рез.Штрихкод));
		стрАртикул = СокрЛП(Строка(рез.Артикул));
		стрНоменклатура = СокрЛП(Строка(рез.Номенклатура));
		стрХарактеристика = СокрЛП(Строка(рез.Характеристика));
		стрОстаток = НормализоватьЧисло(рез.Остаток);
		Если ЗначениеЗаполнено(стрШтрихкод) и ЗначениеЗаполнено(стрОстаток) и (рез.Остаток > 0) Тогда
			контент = контент + ?(контент = "","",Символы.ПС)
				+ стрШтрихкод
				+";"
				+ стрАртикул
				+";"
				+ стрНоменклатура
				+";"
				+ стрХарактеристика
				+";"
				+ стрОстаток
			;
		КонецЕсли;
	КонецЦикла;
	
	ФТПСоединение = Новый FTPСоединение("secret_alsav_ftp",21,"secret_alsav_csv_express_office_login","secret_alsav_csv_express_office_password");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);
	
	//ФТПСоединение.УстановитьТекущийКаталог("/www/alsav.ru/csv_express_office");
	
	ФТПСоединение.Записать(ВременныйФайл,"alsav_express_office.csv"); 
	УдалитьФайлы(ВременныйФайл);	
КонецФункции

Функция ВыгрузитьПрайс() ЭКСПОРТ
	ВыгрузитьПрайсИОстатка();
	
	возврат 0;
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса_Прайс_();	 
	
	группыНоманклатуры = новый Массив();
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ-00020935"));//1.1 Продукция стандартная     
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);
	Запрос.УстановитьПараметр("ДатаЗавтра",КонецДня(ТекущаяДата())+1);
	
	контент = "";
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл    
		Если НЕ(Строка(рез.ДР_Активен)="Да") Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Строка(рез.ДР_Распродажа)="Да") Тогда
			Продолжить;
		КонецЕсли;
		
		контент = контент + ?(контент = "","",Символы.ПС)
			+ СокрЛП(Строка(рез.Серия))
			+";"
			+ СокрЛП(Строка(рез.ВидНоменклатуры))
			+";"
			+ СокрЛП(Строка(рез.Артикул))
			+";"
			+ СокрЛП(Строка(рез.Номенклатура))
			+";"
			+ СокрЛП(Строка(рез.Характеристика))
			+";"
			+ СокрЛП(Строка(рез.Штрихкод))
			+";"
			+ НормализоватьЧисло(рез.Цена)
		;      
	КонецЦикла;
	
	ФТПСоединение = Новый FTPСоединение("secret_alsav_ftp",21,"secret_csv_alsav_login","secret_csv_alsav_password");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);
	
	//ФТПСоединение.УстановитьТекущийКаталог("/csv_alsav");
	
	ФТПСоединение.Записать(ВременныйФайл,"alsav_price.csv"); 
	УдалитьФайлы(ВременныйФайл);

КонецФункции


Функция ВыгрузитьПрайсИОстатка() ЭКСПОРТ
	
	Возврат 0;
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса_Прайс();	 
	
	группыНоманклатуры = новый Массив();
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("УТ-00020935"));//1.1 Продукция стандартная     
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);
	Запрос.УстановитьПараметр("ДатаЗавтра",КонецДня(ТекущаяДата())+1);
	
	контент = "";
	рез = Запрос.Выполнить().Выбрать();
	
	мДанные = новый Массив;
	стрШаблон = "Серия,ВидНоменклатуры,Артикул,Номенклатура,Характеристика,Штрихкод,ЕдиницаИзмерения,Остатки,ОтпускнаяЦена";
	
	Пока рез.Следующий() Цикл    
		Если НЕ(Строка(рез.ДР_Активен)="Да") Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Строка(рез.ДР_Распродажа)="Да") Тогда
			Продолжить;
		КонецЕсли;               
		
		остаток = 0;
		остаток =  рез.ВНаличии - рез.ВРезерве - рез.КОбеспечению - рез.КОбеспечениюИзСборок;
		
		нСтр = Новый Структура(стрШаблон,
			Строка(СокрЛП(рез.Серия)),
			Строка(СокрЛП(рез.ВидНоменклатуры)),
			Строка(СокрЛП(рез.Артикул)),
			Строка(СокрЛП(рез.Номенклатура)),
			Строка(СокрЛП(рез.Характеристика)), 
			Строка(СокрЛП(рез.Штрихкод)),
			Строка(СокрЛП(рез.ЕдиницаИзмерения)),
			остаток,
			рез.ОтпускнаяЦена
		);
		
		мДанные.Добавить(нСтр);
		
		
		
		//контент = контент + ?(контент = "","",Символы.ПС)
		//	+ СокрЛП(Строка(рез.Серия))
		//	+";"
		//	+ СокрЛП(Строка(рез.ВидНоменклатуры))
		//	+";"
		//	+ СокрЛП(Строка(рез.Артикул))
		//	+";"
		//	+ СокрЛП(Строка(рез.Номенклатура))
		//	+";"
		//	+ СокрЛП(Строка(рез.Характеристика))
		//	+";"
		//	+ СокрЛП(Строка(рез.Штрихкод))
		//	+";"
		//	+ СокрЛП(Строка(рез.ЕдиницаИзмерения))
		//	+";"
		//	+ НормализоватьЧисло(остаток)			
		//	+";"
		//	+ НормализоватьЧисло(рез.ОтпускнаяЦена)
		//	
		//;      
	КонецЦикла;     
	
	контент = МассивСтруктурВCSV(мДанные);

	ФТПСоединение = Новый FTPСоединение("secret_alsav_ftp",21,"secret_csv_alsav_login","secret_csv_alsav_password");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("txt");	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,"ostatki_alsav_price.csv"); 	
	УдалитьФайлы(ВременныйФайл);
	
	
	контент_json = СтруктураВjson(мДанные);
	ВременныйФайл = ПолучитьИмяВременногоФайла("json");	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент_json);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,"ostatki_alsav_price.json"); 	
	УдалитьФайлы(ВременныйФайл);                             
КонецФункции

Функция НормализоватьЧисло(ч)
	 Возврат Формат( ч,"ЧГ=0" );
КонецФункции

Функция ПолучитьТекстЗапроса_ХОФФ()
	возврат "   ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДС_ХОФФ.Значение КАК Артикул,
				|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) КАК Остаток
				|ИЗ
				|	(ВЫБРАТЬ
				|		Таблица.Номенклатура КАК Номенклатура,
				|		Таблица.Характеристика КАК Характеристика,
				|		Таблица.Склад КАК Склад,
				|		Таблица.ВНаличии КАК ВНаличии,
				|		0 КАК ПриходОсновной,
				|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
				|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
				|		0 КАК ВРезервеГрафика,
				|		Таблица.КОтгрузке КАК КОтгрузке,
				|		Таблица.КОбеспечению КАК КОбеспечению,
				|		Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
				|	ИЗ
				|		(ВЫБРАТЬ
				|			Набор.Номенклатура КАК Номенклатура,
				|			Набор.Характеристика КАК Характеристика,
				|			Набор.Склад КАК Склад,
				|			СУММА(Набор.ВНаличии) КАК ВНаличии,
				|			СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
				|			СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
				|			СУММА(Набор.КОтгрузке) КАК КОтгрузке,
				|			СУММА(Набор.КОбеспечению) КАК КОбеспечению,
				|			СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
				|		ИЗ
				|			(ВЫБРАТЬ
				|				Таблица.Номенклатура КАК Номенклатура,
				|				Таблица.Характеристика КАК Характеристика,
				|				Таблица.Склад КАК Склад,
				|				Таблица.ВНаличииОстаток КАК ВНаличии,
				|				Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
				|				Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
				|				0 КАК КОтгрузке,
				|				0 КАК КОбеспечению,
				|				0 КАК КОбеспечениюИзСборок
				|			ИЗ
				|				РегистрНакопления.СвободныеОстатки.Остатки(, {((Номенклатура, Характеристика) В
				|						    (ВЫБРАТЬ
				|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
				|						        ТаблицаОтбора.Характеристика КАК Характеристика
				|						    ИЗ
				|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
				|						    ГДЕ
				|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				Таблица.Номенклатура,
				|				Таблица.Характеристика,
				|				Таблица.Склад,
				|				Таблица.КОтгрузкеОстаток,
				|				0,
				|				0,
				|				Таблица.КОтгрузкеОстаток,
				|				0 КАК КОбеспечению,
				|				0 КАК КОбеспечениюИзСборок
				|			ИЗ
				|				РегистрНакопления.ТоварыКОтгрузке.Остатки(, {((Номенклатура, Характеристика) В
				|						    (ВЫБРАТЬ
				|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
				|						        ТаблицаОтбора.Характеристика КАК Характеристика
				|						    ИЗ
				|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
				|						    ГДЕ
				|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
				|						        
				|						        
				|						        
				|						        
				|						        
				|			ОБЪЕДИНИТЬ ВСЕ  
				|			
				|			ВЫБРАТЬ
				|				Таблица.Номенклатура,
				|				Таблица.Характеристика,
				|				Таблица.Склад,
				|				0,
				|				0,
				|				0,
				|				0,
				|				SUM(Таблица.КоличествоНеобеспечено) КАК КОбеспечению,
				|				0
				|			ИЗ
				|				РегистрНакопления.ГрафикОтгрузкиТоваров AS Таблица
				|			{WHERE ((Номенклатура, Характеристика) В
				|						    (ВЫБРАТЬ
				|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
				|						        ТаблицаОтбора.Характеристика КАК Характеристика
				|						    ИЗ
				|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
				|						    ГДЕ
				|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)), (Склад).*, (Номенклатура).*, (Характеристика).*} 
				|			GROUP BY 
				|				Таблица.Номенклатура,
				|				Таблица.Характеристика,
				|				Таблица.Склад
				|			HAVING 
				|				SUM(Таблица.КоличествоНеобеспечено) > 0 
				|				
				|			
				|			ОБЪЕДИНИТЬ ВСЕ  
				|			                    
				|			                    
				|					                    
				|			ВЫБРАТЬ
				|				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
				|				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
				|				Таблица.Склад,
				|				0,
				|				0,
				|				0,
				|				0,
				|				0,
				|				SUM(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено) КАК КОбеспечениюИзСборок
				|			ИЗ
				|			(
				|				ВЫБРАТЬ
				|					Таблица.Номенклатура,
				|					Таблица.Характеристика,
				|					Таблица.Склад,
				|					SUM(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
				|					
				|				ИЗ
				|					РегистрНакопления.ГрафикОтгрузкиТоваров AS Таблица 
				|				GROUP BY 
				|					Таблица.Номенклатура,
				|					Таблица.Характеристика,
				|					Таблица.Склад
				|				HAVING 
				|					SUM(Таблица.КоличествоНеобеспечено) > 0
				|			)Таблица
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
				|				ВЫБРАТЬ
				|					ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
				|					ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
				|					ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
				
				|					ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
				|					ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
				|					ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
				|					ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
				|				ИЗ
				|					Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
				|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
				|						ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
				|							И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
				|							И Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ
				|							И Полуфабрикаты.Ссылка.Основной
				|					ГДЕ ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ И ВариантыКомплектацииНоменклатуры.Ссылка.Основной
				|			) КАК ВТ_ВариантыКомплектацииНоменклатуры
				|				ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.Номенклатура)
				|					И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика IS NULL OR ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.Характеристика) 
				|					
				|			GROUP BY 
				|				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
				|				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
				|				Таблица.Склад
				|				        
				|						        
				|						        
				|		
				|		
				|		
				|		) КАК Набор
				|		
				|		СГРУППИРОВАТЬ ПО
				|			Набор.Номенклатура,
				|			Набор.Характеристика,
				|			Набор.Склад) КАК Таблица) КАК Набор
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДС_Серия
				|		ПО (ДС_Серия.Ссылка = Набор.Номенклатура)
				|			И (ДС_Серия.Свойство.Заголовок = ""Серия"")
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДС_ХОФФ
				|		ПО (ДС_ХОФФ.Ссылка = Набор.Характеристика)
				|			И (ДС_ХОФФ.Свойство.Заголовок = ""Артикул HOFF"")
				|
				|ГДЕ Набор.Склад.Наименование = ""Склад адресного хранения""
				|
				|СГРУППИРОВАТЬ ПО
				|	Набор.Характеристика,
				|	ДС_ХОФФ.Значение
				|HAVING 
				|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) > 0";	
КонецФункции


Функция ПолучитьТекстЗапроса_express_office()
	возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Т_Штрихкоды.Штрихкод КАК Штрихкод,
			|	Набор.Номенклатура.Артикул КАК Артикул,
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) КАК Остаток
			|ИЗ
			|	(ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.ВНаличии КАК ВНаличии,
			|		0 КАК ПриходОсновной,
			|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
			|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
			|		0 КАК ВРезервеГрафика,
			|		Таблица.КОтгрузке КАК КОтгрузке,
			|		Таблица.КОбеспечению КАК КОбеспечению,
			|		Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
			|	ИЗ
			|		(ВЫБРАТЬ
			|			Набор.Номенклатура КАК Номенклатура,
			|			Набор.Характеристика КАК Характеристика,
			|			Набор.Склад КАК Склад,
			|			СУММА(Набор.ВНаличии) КАК ВНаличии,
			|			СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
			|			СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
			|			СУММА(Набор.КОтгрузке) КАК КОтгрузке,
			|			СУММА(Набор.КОбеспечению) КАК КОбеспечению,
			|			СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
			|		ИЗ
			|			(ВЫБРАТЬ
			|				Таблица.Номенклатура КАК Номенклатура,
			|				Таблица.Характеристика КАК Характеристика,
			|				Таблица.Склад КАК Склад,
			|				Таблица.ВНаличииОстаток КАК ВНаличии,
			|				Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
			|				Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
			|				0 КАК КОтгрузке,
			|				0 КАК КОбеспечению,
			|				0 КАК КОбеспечениюИзСборок
			|			ИЗ
			|				РегистрНакопления.СвободныеОстатки.Остатки(, {((Номенклатура, Характеристика) В
			|						    (ВЫБРАТЬ
			|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
			|						        ТаблицаОтбора.Характеристика КАК Характеристика
			|						    ИЗ
			|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
			|						    ГДЕ
			|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				Таблица.Номенклатура,
			|				Таблица.Характеристика,
			|				Таблица.Склад,
			|				Таблица.КОтгрузкеОстаток,
			|				0,
			|				0,
			|				Таблица.КОтгрузкеОстаток,
			|				0,
			|				0
			|			ИЗ
			|				РегистрНакопления.ТоварыКОтгрузке.Остатки(, {((Номенклатура, Характеристика) В
			|						    (ВЫБРАТЬ
			|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
			|						        ТаблицаОтбора.Характеристика КАК Характеристика
			|						    ИЗ
			|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
			|						    ГДЕ
			|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
			|						        
			|						        
			|						        
			|						        
			|						        
			|			ОБЪЕДИНИТЬ ВСЕ  
			|			
			|			ВЫБРАТЬ
			|				Таблица.Номенклатура,
			|				Таблица.Характеристика,
			|				Таблица.Склад,
			|				0,
			|				0,
			|				0,
			|				0,
			|				SUM(Таблица.КоличествоНеобеспечено) КАК КОбеспечению,
			|				0
			|			ИЗ
			|				РегистрНакопления.ГрафикОтгрузкиТоваров AS Таблица
			|			{WHERE ((Номенклатура, Характеристика) В
			|						    (ВЫБРАТЬ
			|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
			|						        ТаблицаОтбора.Характеристика КАК Характеристика
			|						    ИЗ
			|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
			|						    ГДЕ
			|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)), (Склад).*, (Номенклатура).*, (Характеристика).*} 
			|			GROUP BY 
			|				Таблица.Номенклатура,
			|				Таблица.Характеристика,
			|				Таблица.Склад
			|			HAVING 
			|				SUM(Таблица.КоличествоНеобеспечено) > 0
			|				        
			|			ОБЪЕДИНИТЬ ВСЕ  
				|			                    
				|			                    
				|					                    
				|			ВЫБРАТЬ
				|				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
				|				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
				|				Таблица.Склад,
				|				0,
				|				0,
				|				0,
				|				0,
				|				0,
				|				SUM(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено) КАК КОбеспечениюИзСборок
				|			ИЗ
				|			(
				|				ВЫБРАТЬ
				|					Таблица.Номенклатура,
				|					Таблица.Характеристика,
				|					Таблица.Склад,
				|					SUM(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
				|					
				|				ИЗ
				|					РегистрНакопления.ГрафикОтгрузкиТоваров AS Таблица 
				|				GROUP BY 
				|					Таблица.Номенклатура,
				|					Таблица.Характеристика,
				|					Таблица.Склад
				|				HAVING 
				|					SUM(Таблица.КоличествоНеобеспечено) > 0
				|			)Таблица
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
				|				ВЫБРАТЬ
				|					ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
				|					ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
				|					ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
				
				|					ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
				|					ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
				|					ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
				|					ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
				|				ИЗ
				|					Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
				|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
				|						ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
				|							И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
				|							И Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ
				|							И Полуфабрикаты.Ссылка.Основной
				|					ГДЕ ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ И ВариантыКомплектацииНоменклатуры.Ссылка.Основной
				|			) КАК ВТ_ВариантыКомплектацииНоменклатуры
				|				ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.Номенклатура)
				|					И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика IS NULL OR ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.Характеристика) 
				|					
				|			GROUP BY 
				|				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
				|				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
				|				Таблица.Склад		        
			|						        
			|		
			|		
			|		
			|		) КАК Набор
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Набор.Номенклатура,
			|			Набор.Характеристика,
			|			Набор.Склад) КАК Таблица) КАК Набор
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДС_Серия
			|		ПО (ДС_Серия.Ссылка = Набор.Номенклатура)
			|			И (ДС_Серия.Свойство.Заголовок = ""Серия"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДС_ИмеетВариантКомплектации
			|		ПО (ДС_ИмеетВариантКомплектации.Ссылка = Набор.Номенклатура)
			|			И (ДС_ИмеетВариантКомплектации.Свойство.Заголовок = ""Имеет вариант комплектации"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Т_Штрихкоды
			|		ПО Набор.Номенклатура = Т_Штрихкоды.Номенклатура
			|			И (Набор.Характеристика ЕСТЬ NULL
			|				ИЛИ Набор.Характеристика = Т_Штрихкоды.Характеристика)
			|ГДЕ
			//|	Набор.Номенклатура В ИЕРАРХИИ(&группыНоманклатуры) И (ДС_ИмеетВариантКомплектации.Значение IS NULL ИЛИ ДС_ИмеетВариантКомплектации.Значение В (&имеетВариантКомплектации))
			|	Набор.Номенклатура В ИЕРАРХИИ(&группыНоманклатуры)
			|   И Набор.Склад.Наименование = ""Склад адресного хранения""
			|СГРУППИРОВАТЬ ПО
			|	Т_Штрихкоды.Штрихкод,
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Номенклатура.Артикул
			|HAVING 
			|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) > 0";	
КонецФункции
		
		
Функция ПолучитьТекстЗапроса_Прайс_()
	Возврат "ВЫБРАТЬ //ПЕРВЫЕ 100
	        |	ДР_Серия.Значение КАК Серия,
	        |	Цены.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	        |	Цены.Номенклатура.Артикул КАК Артикул,
	        |	Цены.Номенклатура КАК Номенклатура,
	        |	Цены.Характеристика КАК Характеристика,
	        |	Т_Штрихкоды.Штрихкод КАК Штрихкод,
	        |	Цены.Цена КАК ОтпускнаяЦена,
			|	ДР_Активен.Значение КАК ДР_Активен,
			|	ДР_Распродажа.Значение КАК ДР_Распродажа
			|ИЗ
	        |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЗавтра, ВидЦены.Наименование = ""Отпускная цена (с учетом НДС)"") КАК Цены
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Т_Штрихкоды
	        |		ПО Цены.Номенклатура = Т_Штрихкоды.Номенклатура
	        |			И (Цены.Характеристика ЕСТЬ NULL
	        |				ИЛИ Цены.Характеристика = Т_Штрихкоды.Характеристика)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Серия
	        |		ПО Цены.Номенклатура = ДР_Серия.Ссылка
	        |			И (ДР_Серия.Свойство.Заголовок = ""Серия"")
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДР_Активен
	        |		ПО ДР_Активен.Ссылка = Цены.Характеристика
	        |			И (ДР_Активен.Свойство.Заголовок = ""Активность на сайте"")
	        //|			И (ДР_Активен.Значение.Наименование = ""Да"")
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДР_Распродажа
	        |		ПО  ДР_Распродажа.Ссылка = Цены.Характеристика
	        |			И (ДР_Распродажа.Свойство.Заголовок = ""Распродажа"")
	        |ГДЕ
	        //|	(ДР_Распродажа.Значение ЕСТЬ NULL
	        //|			ИЛИ ДР_Распродажа.Значение.Наименование <> ""Да"")
	        |	Цены.Номенклатура В ИЕРАРХИИ(&группыНоманклатуры)
	        |	И Цены.Цена > 0";
КонецФункции        
		
Функция ПолучитьТекстЗапроса_Прайс()
	Возврат "ВЫБРАТЬ
	        |	Набор.Номенклатура.Артикул КАК Артикул,
	        |	Набор.Номенклатура КАК Номенклатура,
	        |	Набор.Характеристика КАК Характеристика,
	        |	Набор.Склад КАК Склад,
	        |	СУММА(Набор.ВНаличии) КАК ВНаличии,
	        |	СУММА(Набор.ПриходОсновной) КАК ПриходОсновной,
	        |	СУММА(Набор.РасходОсновной) КАК РасходОсновной,
	        |	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) КАК ВРезервеСоСкладаИПодЗаказ,
	        |	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика) КАК ВРезерве,
	        |	СУММА(Набор.КОтгрузке) КАК Котгрузке,
	        |	СУММА(Набор.КОбеспечению) КАК КОбеспечению,
	        |	СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
	        |ПОМЕСТИТЬ ВТ_Набор
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		Таблица.Номенклатура КАК Номенклатура,
	        |		Таблица.Характеристика КАК Характеристика,
	        |		Таблица.Склад КАК Склад,
	        |		Таблица.ВНаличии КАК ВНаличии,
	        |		0 КАК ПриходОсновной,
	        |		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
	        |		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
	        |		0 КАК ВРезервеГрафика,
	        |		Таблица.КОтгрузке КАК КОтгрузке,
	        |		Таблица.КОбеспечению КАК КОбеспечению,
	        |		Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			Набор.Номенклатура КАК Номенклатура,
	        |			Набор.Характеристика КАК Характеристика,
	        |			Набор.Склад КАК Склад,
	        |			СУММА(Набор.ВНаличии) КАК ВНаличии,
	        |			СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	        |			СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	        |			СУММА(Набор.КОтгрузке) КАК КОтгрузке,
	        |			СУММА(Набор.КОбеспечению) КАК КОбеспечению,
	        |			СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				Таблица.Номенклатура КАК Номенклатура,
	        |				Таблица.Характеристика КАК Характеристика,
	        |				Таблица.Склад КАК Склад,
	        |				Таблица.ВНаличииОстаток КАК ВНаличии,
	        |				Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	        |				Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
	        |				0 КАК КОтгрузке,
	        |				0 КАК КОбеспечению,
	        |				0 КАК КОбеспечениюИзСборок
	        |			ИЗ
	        |				РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК Таблица
	        |			
	        |			ОБЪЕДИНИТЬ ВСЕ
	        |			
	        |			ВЫБРАТЬ
	        |				Таблица.Номенклатура,
	        |				Таблица.Характеристика,
	        |				Таблица.Склад,
	        |				Таблица.КОтгрузкеОстаток,
	        |				0,
	        |				0,
	        |				Таблица.КОтгрузкеОстаток,
	        |				0,
	        |				0
	        |			ИЗ
	        |				РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК Таблица
	        |			
	        |			ОБЪЕДИНИТЬ ВСЕ
	        |			
	        |			ВЫБРАТЬ
	        |				Таблица.Номенклатура,
	        |				Таблица.Характеристика,
	        |				Таблица.Склад,
	        |				0,
	        |				0,
	        |				0,
	        |				0,
	        |				СУММА(Таблица.КоличествоНеобеспечено),
	        |				0
	        |			ИЗ
	        |				РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				Таблица.Номенклатура,
	        |				Таблица.Характеристика,
	        |				Таблица.Склад
	        |			
	        |			ИМЕЮЩИЕ
	        |				СУММА(Таблица.КоличествоНеобеспечено) > 0
	        |			
	        |			ОБЪЕДИНИТЬ ВСЕ
	        |			
	        |			ВЫБРАТЬ
	        |				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	        |				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	        |				Таблица.Склад,
	        |				0,
	        |				0,
	        |				0,
	        |				0,
	        |				0,
	        |				СУММА(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено)
	        |			ИЗ
	        |				(ВЫБРАТЬ
	        |					Таблица.Номенклатура КАК ГрафикОтгрузкиТоваровНоменклатура,
	        |					Таблица.Характеристика КАК ГрафикОтгрузкиТоваровХарактеристика,
	        |					Таблица.Склад КАК Склад,
	        |					СУММА(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
	        |				ИЗ
	        |					РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	        |				
	        |				СГРУППИРОВАТЬ ПО
	        |					Таблица.Номенклатура,
	        |					Таблица.Характеристика,
	        |					Таблица.Склад
	        |				
	        |				ИМЕЮЩИЕ
	        |					СУММА(Таблица.КоличествоНеобеспечено) > 0) КАК Таблица
	        |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |						состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	        |						состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	        |						состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	        |						состав.ПутьВСборке КАК НоменклатураПутьСборки,
	        |						состав.Номенклатура КАК Номенклатура,
	        |						состав.Характеристика КАК Характеристика,
	        |						состав.Количество КАК Количество,
	        |						состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	        |					ИЗ
	        |						РегистрСведений.алсав_СоставИзделий КАК состав
	        |					ГДЕ
	        |						состав.ЭтоПолуфабрикат = ЛОЖЬ
	        |						И состав.ЭтоМатериалы = ЛОЖЬ) КАК ВТ_ВариантыКомплектацииНоменклатуры
	        |					ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.ГрафикОтгрузкиТоваровНоменклатура)
	        |						И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика ЕСТЬ NULL
	        |							ИЛИ ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.ГрафикОтгрузкиТоваровХарактеристика)
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	        |				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	        |				Таблица.Склад) КАК Набор
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			Набор.Номенклатура,
	        |			Набор.Характеристика,
	        |			Набор.Склад) КАК Таблица) КАК Набор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Набор.Номенклатура.Артикул,
	        |	Набор.Номенклатура,
	        |	Набор.Характеристика,
	        |	Набор.Склад
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) > 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Набор.Артикул КАК Артикул,
	        |	ВТ_Набор.Номенклатура КАК Номенклатура,
	        |	ВТ_Набор.Характеристика КАК Характеристика,
	        |	ВТ_Набор.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	        |	ВТ_Набор.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	ЦеныНоменклатуры.Цена КАК ОтпускнаяЦена,
	        |	ВТ_Набор.Склад КАК Склад,
	        |	ДС_Серия.Значение КАК Серия,
	        |	Т_Штрихкоды.Штрихкод КАК Штрихкод,
	        |	ДР_Активен.Значение КАК ДР_Активен,
	        |	ДР_Распродажа.Значение КАК ДР_Распродажа,
	        |	ВТ_Набор.ВНаличии КАК ВНаличии,
	        |	ВТ_Набор.ПриходОсновной КАК ПриходОсновной,
	        |	ВТ_Набор.РасходОсновной КАК РасходОсновной,
	        |	ВТ_Набор.ВРезервеСоСкладаИПодЗаказ КАК ВРезервеСоСкладаИПодЗаказ,
	        |	ВТ_Набор.ВРезерве КАК ВРезерве,
	        |	ВТ_Набор.Котгрузке КАК Котгрузке,
	        |	ВТ_Набор.КОбеспечению КАК КОбеспечению,
	        |	ВТ_Набор.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
	        |ИЗ
	        |	ВТ_Набор КАК ВТ_Набор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены.Наименование = ""Отпускная цена (с учетом НДС)"") КАК ЦеныНоменклатуры
	        |		ПО ВТ_Набор.Номенклатура = ЦеныНоменклатуры.Номенклатура
	        |			И (ВТ_Набор.Характеристика ЕСТЬ NULL
	        |				ИЛИ ВТ_Набор.Характеристика = ЦеныНоменклатуры.Характеристика)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДС_Серия
	        |		ПО (ДС_Серия.Ссылка = ВТ_Набор.Номенклатура)
	        |			И (ДС_Серия.Свойство.Заголовок = ""Серия"")
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВТ.Номенклатура КАК Номенклатура,
	        |			ВТ.Характеристика КАК Характеристика,
	        |			МАКСИМУМ(ВТ.Штрихкод) КАК Штрихкод
	        |		ИЗ
	        |			РегистрСведений.ШтрихкодыНоменклатуры КАК ВТ
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВТ.Номенклатура,
	        |			ВТ.Характеристика) КАК Т_Штрихкоды
	        |		ПО ВТ_Набор.Номенклатура = Т_Штрихкоды.Номенклатура
	        |			И (ВТ_Набор.Характеристика ЕСТЬ NULL
	        |				ИЛИ ВТ_Набор.Характеристика = Т_Штрихкоды.Характеристика)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДР_Активен
	        |		ПО (ДР_Активен.Ссылка = ВТ_Набор.Характеристика)
	        |			И (ДР_Активен.Свойство.Заголовок = ""Активность на сайте"")
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДР_Распродажа
	        |		ПО (ДР_Распродажа.Ссылка = ВТ_Набор.Характеристика)
	        |			И (ДР_Распродажа.Свойство.Заголовок = ""Распродажа"")
	        |ГДЕ
	        |	ВТ_Набор.Номенклатура В ИЕРАРХИИ(&группыНоманклатуры)
	        |	И ЦеныНоменклатуры.Цена > 0";
КонецФункции



Функция ВыгрузитьКОМУС() ЭКСПОРТ            
	
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса_КОМУС(); 
	
	Запрос.УстановитьПараметр("ДатаЗавтра",КонецДня(ТекущаяДата())+1);
	
	данные = новый массив;
	
	рез = Запрос.Выполнить().Выбрать();
	//поляШаблон = "Артикул,Штрихкод,НаименованиеТовара,Цена,Остаток";
	поляШаблон = "Артикул,НаименованиеТовара,Цена,Остаток";
	Пока Рез.Следующий() Цикл
		нСтр = Новый Структура(поляШаблон);
		ЗаполнитьЗначенияСвойств(нСтр, Рез); 
		Если Рез.СерияНаименование = "HORECA" Тогда
			нСтр.Цена = Окр(нСтр.Цена * 0.9,2);
		Иначе
			нСтр.Цена = Окр(нСтр.Цена * 0.75, 2);
		КонецЕсли;
		данные.Добавить(нСтр);
	КонецЦикла;	
	
	контент = СтруктураВjson(данные);	
	
	ФТПСоединение = Новый FTPСоединение("secret_alsav_ftp",21,"secret_alsav_json_login","secret_alsav_json_password");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);
	
	ФТПСоединение.Записать(ВременныйФайл,"ostatki.json"); 
	УдалитьФайлы(ВременныйФайл);	

КонецФункции

Функция ПолучитьТекстЗапроса_КОМУС()
	
	текстЗапроса = "ВЫБРАТЬ //ПЕРВЫЕ 100
	               |	Номен.Ссылка.Артикул КАК Артикул,
	               |	Т_Штрихкоды.Штрихкод КАК Штрихкод,
				   |	ДР_Серия.Значение КАК Серия,
				   |	ДР_Серия.Значение.Наименование КАК СерияНаименование,
	               |	Номен.Ссылка.Наименование КАК НаименованиеТовара,
	               |	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	               |	ЕСТЬNULL(Набор.ВНаличии - (Набор.ВРезервеСоСкладаИПодЗаказ + Набор.ВРезервеГрафика) - Набор.КОбеспечению - Набор.КОбеспечениюИзСборок, 0) КАК Остаток
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номен
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Хар
	               |		ПО (Хар.Владелец = Номен.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДР_АртикулКоммус
	               |		ПО (ДР_АртикулКоммус.Ссылка = Хар.Ссылка)
	               |			И (ДР_АртикулКоммус.Свойство.Заголовок = ""Распродажа"")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Серия
	               |		ПО Номен.Ссылка = ДР_Серия.Ссылка
	               |			И (ДР_Серия.Свойство.Заголовок = ""Серия"")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Т_Штрихкоды
	               |		ПО Номен.Ссылка = Т_Штрихкоды.Номенклатура
	               |			И (Хар.Ссылка ЕСТЬ NULL
	               |				ИЛИ Хар.Ссылка = Т_Штрихкоды.Характеристика)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЗавтра, ВидЦены.Наименование = ""Отпускная цена (с учетом НДС)"") КАК Цены
	               |		ПО (Цены.Номенклатура = Т_Штрихкоды.Номенклатура)
	               |			И (Цены.Характеристика ЕСТЬ NULL
	               |				ИЛИ Цены.Характеристика = Т_Штрихкоды.Характеристика)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Таблица.Номенклатура КАК Номенклатура,
	               |			Таблица.Характеристика КАК Характеристика,
	               |			Таблица.ВНаличии КАК ВНаличии,
	               |			0 КАК ПриходОсновной,
	               |			Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
	               |			Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
	               |			0 КАК ВРезервеГрафика,
	               |			Таблица.КОтгрузке КАК КОтгрузке,
	               |			Таблица.КОбеспечению КАК КОбеспечению,
	               |			Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				Набор.Номенклатура КАК Номенклатура,
	               |				Набор.Характеристика КАК Характеристика,
	               |				СУММА(Набор.ВНаличии) КАК ВНаличии,
	               |				СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	               |				СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	               |				СУММА(Набор.КОтгрузке) КАК КОтгрузке,
	               |				СУММА(Набор.КОбеспечению) КАК КОбеспечению,
	               |				СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					Таблица.Номенклатура КАК Номенклатура,
	               |					Таблица.Характеристика КАК Характеристика,
	               |					Таблица.Склад КАК Склад,
	               |					Таблица.ВНаличииОстаток КАК ВНаличии,
	               |					Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	               |					Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
	               |					0 КАК КОтгрузке,
	               |					0 КАК КОбеспечению,
	               |					0 КАК КОбеспечениюИзСборок
	               |				ИЗ
	               |					РегистрНакопления.СвободныеОстатки.Остатки(, {((Номенклатура, Характеристика) В
	               |							    (ВЫБРАТЬ
	               |							        ТаблицаОтбора.Номенклатура КАК Номенклатура,
	               |							        ТаблицаОтбора.Характеристика КАК Характеристика
	               |							    ИЗ
	               |							        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
	               |							    ГДЕ
	               |							        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					Таблица.Номенклатура,
	               |					Таблица.Характеристика,
	               |					Таблица.Склад,
	               |					Таблица.КОтгрузкеОстаток,
	               |					0,
	               |					0,
	               |					Таблица.КОтгрузкеОстаток,
	               |					0,
	               |					0
	               |				ИЗ
	               |					РегистрНакопления.ТоварыКОтгрузке.Остатки(, {((Номенклатура, Характеристика) В
	               |							    (ВЫБРАТЬ
	               |							        ТаблицаОтбора.Номенклатура КАК Номенклатура,
	               |							        ТаблицаОтбора.Характеристика КАК Характеристика
	               |							    ИЗ
	               |							        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
	               |							    ГДЕ
	               |							        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					Таблица.Номенклатура,
	               |					Таблица.Характеристика,
	               |					Таблица.Склад,
	               |					0,
	               |					0,
	               |					0,
	               |					0,
	               |					СУММА(Таблица.КоличествоНеобеспечено),
	               |					0
	               |				ИЗ
	               |					РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	               |				{ГДЕ
	               |					((Таблица.Номенклатура, Таблица.Характеристика) В
	               |							(ВЫБРАТЬ
	               |								ТаблицаОтбора.Номенклатура КАК Номенклатура,
	               |								ТаблицаОтбора.Характеристика КАК Характеристика
	               |							ИЗ
	               |								ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
	               |							ГДЕ
	               |								ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2,
	               |					Таблица.Склад.*,
	               |					Таблица.Номенклатура.*,
	               |					Таблица.Характеристика.*}
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					Таблица.Номенклатура,
	               |					Таблица.Характеристика,
	               |					Таблица.Склад
	               |				
	               |				ИМЕЮЩИЕ
	               |					СУММА(Таблица.КоличествоНеобеспечено) > 0
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	               |					ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	               |					Таблица.Склад,
	               |					0,
	               |					0,
	               |					0,
	               |					0,
	               |					0,
	               |					СУММА(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено)
	               |				ИЗ
	               |					(ВЫБРАТЬ
	               |						Таблица.Номенклатура КАК Номенклатура,
	               |						Таблица.Характеристика КАК Характеристика,
	               |						Таблица.Склад КАК Склад,
	               |						СУММА(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
	               |					ИЗ
	               |						РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
	               |					
	               |					СГРУППИРОВАТЬ ПО
	               |						Таблица.Номенклатура,
	               |						Таблица.Характеристика,
	               |						Таблица.Склад
	               |					
	               |					ИМЕЮЩИЕ
	               |						СУММА(Таблица.КоличествоНеобеспечено) > 0) КАК Таблица
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	               |							ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
	               |							ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
	               |							ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
	               |							ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
	               |							ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
	               |							ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	               |						ИЗ
	               |							Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
	               |								ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
	               |								ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
	               |									И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
	               |									И (Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ)
	               |									И (Полуфабрикаты.Ссылка.Основной)
	               |						ГДЕ
	               |							ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |							И ВариантыКомплектацииНоменклатуры.Ссылка.Основной) КАК ВТ_ВариантыКомплектацииНоменклатуры
	               |						ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.Номенклатура)
	               |							И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика ЕСТЬ NULL
	               |								ИЛИ ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.Характеристика)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
	               |					ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
	               |					Таблица.Склад) КАК Набор
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				Набор.Номенклатура,
	               |				Набор.Характеристика) КАК Таблица) КАК Набор
	               |		ПО (Набор.Номенклатура = Т_Штрихкоды.Номенклатура)
	               |			И (Набор.Характеристика ЕСТЬ NULL
	               |				ИЛИ Набор.Характеристика = Т_Штрихкоды.Характеристика)";  
	
	
	Возврат текстЗапроса;
КонецФункции
